Revit 2026 API

# DefinitionGroups Methods

---

The DefinitionGroups type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Contains | Tests for the existence of a definition group within the collection. |
|  | Create | Create a new parameter definition group using the name provided. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Retrieves an enumerator to the collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DefinitionGroups Class

Autodesk.Revit.DB Namespace